Revit 2017 API
AngularDimension.SetRadius Method
 Set radius of an Angular Dimension arc. The new radius of the arc.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public void SetRadius(
	double radius
)
Visual Basic
Public Sub SetRadius ( _
	radius As Double _
)
Visual C++
public:
void SetRadius(
	double radius
)
Parameters
radius
Type: System.Double
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for radius must be non-negative.
See Also
AngularDimension Class
Autodesk.Revit.DB Namespace